app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "zed"], ["body", "dadasdsad"], ["post_id", 1], ["created_at", "2017-12-08 06:45:43.256788"], ["updated_at", "2017-12-08 06:45:43.256788"]]

   def destroy
    if @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]

  def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 1], ["id", 1], ["LIMIT", 1]]